app/views/post/post.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
---

    <% @post1 = Post.find(params[:id].to_i) %>