app/controllers/application_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @posts = Post.all
    @post1 = Post.find(params[:id].to_i)

SELECT "posts".* FROM "posts"
---
  def allPosts
    @posts = Post.all