app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title"], ["body", "Body"], ["created_at", "2015-11-04 23:02:37.940756"], ["updated_at", "2015-11-04 23:02:37.940756"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Second Post"], ["updated_at", "2015-11-05 00:30:16.768236"], ["id", 7]]

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
    Post.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]
SELECT "posts".* FROM "posts"

  def all
    @posts = Post.all
---
SELECT "posts".* FROM "posts"